"""
Реалізувати двійковий пошук для відсортованого масиву з дробовими числами.
Написана функція для двійкового пошуку повинна повертати кортеж, де першим елементом є
кількість ітерацій, потрібних для знаходження елемента. Другим елементом має бути
"верхня межа" — це найменший елемент, який є більшим або рівним заданому значенню.
"""


def binary_search(arr, x):
    low = 0
    high = len(arr) - 1
    mid = 0
    counter = 1

    while low <= high:

        counter += 1
        mid = (high + low) // 2

        # якщо x більше за значення посередині списку, ігноруємо ліву половину
        if arr[mid] < x:
            low = mid + 1

        # якщо x менше за значення посередині списку, ігноруємо праву половину
        elif arr[mid] > x:
            high = mid - 1

        # інакше x присутній на позиції і повертаємо його
        else:
            break

    # якщо елемент не знайдений
    return (counter, arr[mid])


if __name__ == '__main__':
    arr = [2.1, 3.2, 4.1, 10.1, 40.2]
    x = 3.2
    result = binary_search(arr, x)

    assert binary_search(arr, 3.2)[1] == 3.2
    assert binary_search(arr, 1)[1] == 2.1
    assert binary_search(arr, 41)[1] == 40.2
